a<-table(file@table_in[[2]])
> a

0         1         Ж         М паркетный 
12        59        11        38         1 
> a<- data.frame(a)
> a
Var1 Freq
1         0   12
2         1   59
3         Ж   11
4         М   38
5 паркетный    1
> a <- t.data.frame(a)
> a
[,1] [,2] [,3] [,4] [,5]       
Var1 "0"  "1"  "Ж"  "М"  "паркетный"
Freq "12" "59" "11" "38" " 1"       
> names(a)
NULL
> rownames(a)
[1] "Var1" "Freq"
> rownames(a) <- NULL
> a
[,1] [,2] [,3] [,4] [,5]       
[1,] "0"  "1"  "Ж"  "М"  "паркетный"
[2,] "12" "59" "11" "38" " 1"       
> a[1,1]
[1] "0"
> a[2,1]
[1] "12"
> rbind(a, names(file@table_in[2]))
[,1]  [,2]  [,3]  [,4]  [,5]       
[1,] "0"   "1"   "Ж"   "М"   "паркетный"
[2,] "12"  "59"  "11"  "38"  " 1"       
[3,] "пол" "пол" "пол" "пол" "пол"      
> a
[,1] [,2] [,3] [,4] [,5]       
[1,] "0"  "1"  "Ж"  "М"  "паркетный"
[2,] "12" "59" "11" "38" " 1"       
> data.frame(a)
X1 X2 X3 X4        X5
1  0  1  Ж  М паркетный
2 12 59 11 38         1